!==================================================================================================
! 变量模块
! 主要功能: 定义变量和常数
! 创建日期: 2020年7月3日
! 修改日志:
!          2020年8月31日, 修改了部分变量命名
!==================================================================================================


MODULE BAS
!**************************************************************************************************
! 基本模块
!**************************************************************************************************

  IMPLICIT NONE

  !------------------------------------------------------------------------------------------------
  !           子程序包控制
  !------------------------------------------------------------------------------------------------

  LOGICAL :: L_SWF_BAS

  !------------------------------------------------------------------------------------------------
  !           日志文件
  !------------------------------------------------------------------------------------------------

  INTEGER, PARAMETER :: U_LOG = 900
  CHARACTER(LEN = 256) :: S_LOG = 'LOG.TXT'

  !------------------------------------------------------------------------------------------------
  !           输入文件
  !------------------------------------------------------------------------------------------------

  ! 基本数据输入文件
  INTEGER, PARAMETER :: U_IN_BAS = 100
  CHARACTER(LEN = 256) :: S_IN_BAS = 'BAS.IN'

  ! 土壤数据输入文件
  INTEGER, PARAMETER :: U_IN_SOL = 110
  CHARACTER(LEN = 256) :: S_IN_SOL

  ! 应力期数据输入文件
  INTEGER, PARAMETER :: U_IN_PER = 120
  CHARACTER(LEN = 256) :: S_IN_PER

  !------------------------------------------------------------------------------------------------
  !           常规设置
  !------------------------------------------------------------------------------------------------

  ! 程序名称
  CHARACTER(LEN = 80), DIMENSION(5), PARAMETER :: APPNAM = (/                          &
    '================================================================================', &
    '                              农田水热盐运移数值模型                              ', &
    '                                    FIRI-WHS                                    ', &
    '                            中国农业科学院农田灌溉研究所                          ', &
    '================================================================================'/)

  ! 项目名称, 限 100 个英文字符
  CHARACTER(LEN = 100) :: PRJNAM

  ! 模拟场景
  ! ISCENE = 1, 野外
  !        = 2, 室内
  INTEGER :: ISCENE

  ! 控制是否输入作物数据
  ! LCROP = .TRUE., 是
  !       = .FALSE., 否
  LOGICAL :: LCROP

  ! 运行模式
  ! IRUNMOD = 1, 正常模式, 出错时退出程序
  !         = 2, 安静模式, 出错时退出程序
  !         = 3, 安静模式, 出错时继续运行
  INTEGER :: IRUNMOD

  ! 错误代码
  ! IERRCOD = 0, 正常
  !         = 1, 土壤水分运动方程组系数错误
  !         = 2, 土壤水分运动方程组的解不收敛
  !         = 3, 土壤盐分运移方程组系数错误
  !         = 4, 土壤盐分运移方程组的解不收敛
  INTEGER :: IERRCOD

  !------------------------------------------------------------------------------------------------
  !           模型规模
  !------------------------------------------------------------------------------------------------

  ! 土壤材料数量
  INTEGER :: NMAT

  ! 土壤单元体数量
  INTEGER :: NCEL

  ! 应力期数量
  INTEGER :: NPER

  ! 每个应力期的时长 (d)
  REAL, DIMENSION(:), ALLOCATABLE :: PERLEN

  ! 每个应力期的时段数量
  INTEGER, DIMENSION(:), ALLOCATABLE :: NSTP

  ! 每个应力期的时段步长增量因子
  REAL, DIMENSION(:), ALLOCATABLE :: TSMLT

  ! 每个应力期的输出选项
  ! IPRNT(I) = 0, 不输出到任何文件
  !          = 1, 输出到所有文件
  !          = 2, 仅输出到土壤剖面数据文件和应力期数据文件
  !          = 3, 仅输出到土壤剖面数据文件和观测点数据文件
  !          = 4, 仅输出到应力期数据文件和观测点数据文件
  INTEGER, DIMENSION(:), ALLOCATABLE :: IPRNT

  ! 当前时段步长
  REAL :: DELT

  ! 模拟总时长
  REAL :: TOTIM

  ! 应力期循环计数器
  INTEGER :: JPER

  ! 时段循环计数器
  INTEGER :: JSTP

  ! 迭代求解循环计数器
  INTEGER :: JITR

  ! 最大迭代次数
  INTEGER :: MXITR

  ! 控制方程组的解是否收敛
  ! LCONV = .TURE., 收敛
  !         .FALSE., 不收敛
  LOGICAL :: LCONV

  !------------------------------------------------------------------------------------------------
  !           土壤单元体基本特性
  !------------------------------------------------------------------------------------------------

  ! 土壤材料索引号
  INTEGER, DIMENSION(:), ALLOCATABLE :: IMAT

  ! 观测点标记
  ! IOBS(I) = 0, 不标记
  !         > 0, 用正整数标记为观测点
  INTEGER, DIMENSION(:), ALLOCATABLE :: IOBS

  ! 尺寸 (cm)
  REAL, DIMENSION(:), ALLOCATABLE :: DELV

  ! 顶部, 中心和底部的位置 (cm)
  REAL, DIMENSION(:, :), ALLOCATABLE :: LOCV

END MODULE BAS


MODULE SWF
!**************************************************************************************************
! 土壤水分运动模块
!**************************************************************************************************

  IMPLICIT NONE

  !------------------------------------------------------------------------------------------------
  !           土壤水分运动的子程序包控制
  !------------------------------------------------------------------------------------------------
  LOGICAL :: L_SWF_STO
  LOGICAL :: L_SWF_CCF
  LOGICAL :: L_SWF_GBB
  LOGICAL :: L_SWF_GTB
  LOGICAL :: L_SWF_INF
  LOGICAL :: L_SWF_EVP
  LOGICAL :: L_SWF_RWU
  LOGICAL :: L_SWF_TMA

  !------------------------------------------------------------------------------------------------
  !           土壤水分运动的输出文件
  !------------------------------------------------------------------------------------------------

  ! 土壤剖面数据输出文件
  INTEGER, PARAMETER :: U_SWF_PFL = 200
  CHARACTER(LEN = 256) :: S_SWF_PFL

  ! 应力期数据输出文件
  INTEGER, PARAMETER :: U_SWF_PER = 210
  CHARACTER(LEN = 256) :: S_SWF_PER

  ! 观测点数据输出文件
  INTEGER, PARAMETER :: U_SWF_OBS = 220
  CHARACTER(LEN = 256) :: S_SWF_OBS

  !------------------------------------------------------------------------------------------------
  !           土壤水分运动方程组求解
  !------------------------------------------------------------------------------------------------

  ! 土壤水分运动方程组系数
  REAL, DIMENSION(:, :), ALLOCATABLE :: CV
  REAL, DIMENSION(:),    ALLOCATABLE :: HCOF
  REAL, DIMENSION(:),    ALLOCATABLE :: RHS

  ! 水势收敛容差 (cm)
  REAL :: HTOL

  ! 含水率收敛容差 (cm^3 cm^-3)
  REAL :: OTOL

  !------------------------------------------------------------------------------------------------
  !           土壤材料的水分运动特性
  !------------------------------------------------------------------------------------------------

  ! 残余含水率 (cm^3 cm^-3)
  REAL, DIMENSION(:), ALLOCATABLE :: ORES

  ! 饱和含水率 (cm^3 cm^-3)
  REAL, DIMENSION(:), ALLOCATABLE :: OSAT

  ! 饱和导水率 (cm d^-1)
  REAL, DIMENSION(:), ALLOCATABLE :: HYCONSAT

  ! 进气值的倒数 (cm^-1) - Mualem & van Genuchten 公式参数
  REAL, DIMENSION(:), ALLOCATABLE :: MVGA

  ! 孔径分布指数 - Mualem & van Genuchten 公式参数
  REAL, DIMENSION(:), ALLOCATABLE :: MVGN

  ! 孔隙连结性参数 - Mualem & van Genuchten 公式参数
  REAL, DIMENSION(:), ALLOCATABLE :: MVGL

  ! 凋萎含水率 (cm^3 cm^-3)
  REAL, DIMENSION(:), ALLOCATABLE :: OWP

  ! 田间持水率 (cm^3 cm^-3)
  REAL, DIMENSION(:), ALLOCATABLE :: OFC

  !------------------------------------------------------------------------------------------------
  !           土壤水分运动的初始条件
  !------------------------------------------------------------------------------------------------

  ! 初始条件类型
  ! ISWFINI = 0, 初始条件为水势
  !         = 1, 初始条件为含水率
  INTEGER :: ISWFINI

  ! 土壤剖面的初始水势 (cm)
  REAL, DIMENSION(:), ALLOCATABLE :: HINI

  ! 土壤剖面的初始含水率 (cm^3 cm^-3)
  REAL, DIMENSION(:), ALLOCATABLE :: OINI

  !------------------------------------------------------------------------------------------------
  !           土壤水分运动的底部边界条件
  !------------------------------------------------------------------------------------------------
  ! 底部边界条件类型
  ! ISWFBOT = 1, Dirichlet 条件, 需要输入底部边界的水势或含水率
  !         = 2, Neumann 条件, 需要输入底部边界的水量
  !         = 3, Cauchy 条件, 需要输入底部边界的水势和延迟时间
  !         = 4, 自由排水条件, 不需要输入其他数据
  !         = 5, 渗出面条件, 不需要输入其他数据
  INTEGER :: ISWFBOT

  ! 底部边界的延迟时间（d）
  INTEGER :: TLAGBOT

  ! 每个应力期底部边界的水势 (cm)
  REAL, DIMENSION(:), ALLOCATABLE :: HBOT

  ! 每个应力期底部边界的含水率 (cm^3 cm^-3)
  REAL, DIMENSION(:), ALLOCATABLE :: OBOT

  ! 每个应力期底部边界的水流量 (cm)
  REAL, DIMENSION(:), ALLOCATABLE :: WBOT

  ! 当前时段底部边界的水流量 (cm)
  REAL :: QBOT

  !------------------------------------------------------------------------------------------------
  !           土壤水分运动的地表边界条件
  !------------------------------------------------------------------------------------------------
  ! 地表边界条件类型
  ! ISWFTOP = 1, Dirichlet 条件, 需要输入地表边界的水势或含水率
  !         = 2, Neumann 条件, 需要输入地表边界的水量
  !         = 3, Cauchy 条件, 需要输入地表边界的水势和延迟时间
  INTEGER :: ISWFTOP

  ! 地表边界的延迟时间（d）
  INTEGER :: TLAGTOP

  ! 每个应力期地表边界的水势 (cm)
  REAL, DIMENSION(:), ALLOCATABLE :: HTOP

  ! 每个应力期地表边界的含水率 (cm^3 cm^-3)
  REAL, DIMENSION(:), ALLOCATABLE :: OTOP

  ! 每个应力期地表边界的水流量 (cm)
  REAL, DIMENSION(:), ALLOCATABLE :: WTOP

  ! 当前时段地表边界的水流量 (cm)
  REAL :: QTOP

  ! 前一时段结束时的地表积水深度 (cm)
  REAL :: HPONDOLD

  ! 当前时段开始时的地表积水深度 (cm)
  REAL :: HPONDNEW

  ! 地表最大允许积水深度 (cm)
  REAL :: HPONDMAX

  ! 地表风干水势 (cm)
  REAL :: HATM

  ! 每个应力期达到地表的水量 (cm)
  REAL, DIMENSION(:), ALLOCATABLE :: WSURF

  ! 当前时段达到地表的水量 (cm)
  REAL :: QSURF

  ! 每个应力期的地表径流量 (cm)
  REAL, DIMENSION(:), ALLOCATABLE :: WRNOF

  ! 当前时段的地表径流量 (cm)
  REAL :: QRNOF

  ! 每个应力期的地表入渗量 (cm)
  REAL, DIMENSION(:), ALLOCATABLE :: WINF

  ! 当前时段的地表入渗量 (cm)
  REAL :: QINF

  ! 每个应力期的潜在蒸发量 (cm)
  REAL, DIMENSION(:), ALLOCATABLE :: WEPOT

  ! 当前时段的潜在蒸发量 (cm)
  REAL :: QEPOT

  ! 每个应力期的实际蒸发量 (cm)
  REAL, DIMENSION(:), ALLOCATABLE :: WEACT

  ! 当前时段的实际蒸发量 (cm)
  REAL :: QEACT

  !------------------------------------------------------------------------------------------------
  !           土壤单元体的水分运动参数, 存量和流量
  !------------------------------------------------------------------------------------------------

  ! 水容量 (cm^-1)
  REAL, DIMENSION(:), ALLOCATABLE :: HYCAP

  ! 非饱和导水率 (cm d^-1)
  REAL, DIMENSION(:), ALLOCATABLE :: HYCON

  ! 前一时段结束时的水势 (cm)
  REAL, DIMENSION(:), ALLOCATABLE :: HOLD

  ! 当前时段开始时的水势 (cm)
  REAL, DIMENSION(:), ALLOCATABLE :: HNEW

  ! 前一时段结束时的含水率 (cm^3 cm^-3)
  REAL, DIMENSION(:), ALLOCATABLE :: OOLD

  ! 当前时段开始时的含水率 (cm^3 cm^-3)
  REAL, DIMENSION(:), ALLOCATABLE :: ONEW

  ! 当前时段土壤单元体之间的水流量 (cm)
  REAL, DIMENSION(:, :), ALLOCATABLE :: QV

  !------------------------------------------------------------------------------------------------
  !           作物根系吸水
  !------------------------------------------------------------------------------------------------

  ! 根系吸水的计算方法
  ! IRWU = 0, 用户输入根系吸水量, 主要用于根系吸水量的反演
  !      = 1, 采用 Feddes 模型计算, 根系吸水分布由用户输入
  !      = 2, 采用 Feddes 模型计算, 根系吸水分布为指数函数
  INTEGER :: IRWU

  ! 根系吸水分布指数函数的参数
  REAL :: PRWUDIST

  ! 根系吸水补偿系数
  REAL :: RWUCOMP

  ! 根系吸水补偿系数的临界值
  REAL :: RWUCOMPCRT

  ! Feddes 模型根系吸水水分胁迫响应函数的临界水势 (cm)
  ! RWUHCRT(1) = H1,  厌氧点的临界水势, 当土壤水势大于或等于此临界值时, 水分胁迫响应函数值等于 0
  ! RWUHCRT(1) = H2,  当土壤水势介于 H3 和 H2 之间，水分胁迫响应函数值等于 1
  ! RWUHCRT(1) = H3H
  ! RWUHCRT(1) = H3L
  ! RWUHCRT(1) = H4,  凋萎时的临界水势, 当土壤水势小于或等于此临界值时, 水分胁迫响应函数值等于 0
  REAL, DIMENSION(5) :: RWUHCRT

  ! Feddes 模型根系吸水水分胁迫响应函数的临界蒸腾速率 (cm d^-1)
  ! RWUTCRT(1) = T3H
  ! RWUTCRT(2) = T3L
  REAL, DIMENSION(2) :: RWUTCRT

  ! 土壤剖面的根系吸水分布
  REAL, DIMENSION(:), ALLOCATABLE :: RWUDIST

  ! 每个应力期的根系深度 (cm)
  REAL, DIMENSION(:), ALLOCATABLE :: RDEPTH

  ! 每个应力期内的潜在蒸腾量 (cm)
  REAL, DIMENSION(:), ALLOCATABLE :: WTPOT

  ! 每个应力期内的实际蒸腾量 (cm)
  REAL, DIMENSION(:), ALLOCATABLE :: WTACT

  ! 当前应力期土壤剖面根系实际吸水量 (cm)
  REAL, DIMENSION(:), ALLOCATABLE :: WRWUACT

  ! 时段内土壤剖面的根系实际吸水量 (cm)
  REAL, DIMENSION(:), ALLOCATABLE :: QRWUACT

END MODULE SWF
